DELETE
FROM meals;
DELETE
FROM user_roles;
DELETE
FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('ROLE_USER', 100000),
       ('ROLE_ADMIN', 100001);

-- INSERT INTO meals (user_id, description, calories, datetime)
-- VALUES (100001, 'Завтрак', 400, '2015-06-30 08:00:0'),
--        (100001, 'Обед', 900, '2015-06-30 12:00:00'),
--        (100001, 'Ужин', 75, '2015-06-30 18:00:00');

INSERT INTO meals (user_id, description, calories, datetime)
-- VALUES (100000, 'Завтрак', 500, '2015-05-30 10:00:00'),
--        (100000, 'Обед', 1000, '2015-05-30 13:00:00'),
--        (100000, 'Ужин', 500, '2015-05-30 20:00:00'),
--        (100000, 'Завтрак', 1000, '2015-05-31 10:00:0'),
--        (100000, 'Обед', 500, '2015-05-31 13:00:00'),
--        (100000, 'Ужин', 510, '2015-05-31 20:00:00');

VALUES (100000, 'Завтрак', 500, '2015-05-30 10:00:00'),
       (100000, 'Обед', 1000, '2015-05-30 13:00:00'),
       (100000, 'Ужин', 500, '2015-05-30 20:00:00'),
       (100000, 'Завтрак', 1000, '2015-05-31 10:00:0'),
       (100000, 'Обед', 500, '2015-05-31 13:00:00'),
       (100000, 'Ужин', 510, '2015-05-31 20:00:00'),
       (100001, 'Завтрак', 400, '2015-06-30 08:00:0'),
       (100001, 'Обед', 900, '2015-06-30 12:00:00'),
       (100001, 'Ужин', 750, '2015-06-30 18:00:00')